{
  "en": {
    "easy_simple": {
      "daily_life": [
        "Describe your morning routine in two or three simple sentences.",
        "What do you usually eat for breakfast? Describe it briefly.",
        "Write three sentences about your commute or how you get to work/school."
      ],
      "general": [
        "Introduce yourself in a few simple sentences (name, where you're from, job).",
        "Describe your favorite hobby very briefly.",
        "Name three things that make you happy and explain one in a sentence."
      ],
      "opinion": [
        "Say whether you prefer coffee or tea and why in one sentence.",
        "Do you like reading? Give a short reason why or why not.",
        "Is outdoor exercise important? Write one sentence explaining your opinion."
      ]
    },

    "easy_intermediate": {
      "daily_life": [
        "Describe a typical weekend using a few connected sentences.",
        "Explain a small problem you had recently and how you solved it.",
        "Write about a meal you cooked recently and how it turned out."
      ],
      "general": [
        "Describe a friend and explain why you enjoy spending time with them.",
        "Write about your town or city in a short paragraph.",
        "Explain a routine you want to change and why."
      ],
      "opinion": [
        "Do you think social media is helpful? Give two short reasons.",
        "Should students have homework? Explain your opinion briefly.",
        "Is public transport important in cities? State your view and one reason."
      ]
    },

    "easy_complex": {
      "daily_life": [
        "Tell a short story about a surprising small event from your day.",
        "Describe a habit you adopted recently and why it helped you.",
        "Explain an everyday activity in steps as if teaching a beginner."
      ],
      "general": [
        "Compare two places you like and explain the differences.",
        "Describe how your favorite season affects your mood or routine.",
        "Explain a tradition your family follows during holidays."
      ],
      "opinion": [
        "Is technology making life easier or harder? Give a clear opinion and example.",
        "Should people learn multiple languages? Give reasons for your view.",
        "Discuss whether working from home is better than working in an office."
      ]
    },

    "medium_simple": {
      "daily_life": [
        "Outline how you organize your day when you have a busy schedule.",
        "Describe a recent daytrip and what you did step-by-step.",
        "Write a brief plan for an ideal weekend including times."
      ],
      "general": [
        "Describe a goal you're working toward and the steps to achieve it.",
        "Explain how a hobby of yours developed over time.",
        "Describe a role model and what you learned from them."
      ],
      "opinion": [
        "Are community centers important? Argue your case briefly.",
        "Should schools teach practical life skills? Support your position.",
        "Is diet or exercise more important for health? State and defend your choice."
      ]
    },

    "medium_intermediate": {
      "daily_life": [
        "Describe a challenge you faced and the strategy you used to overcome it.",
        "Explain how you prepare for an important meeting or exam.",
        "Describe the steps you take when learning something new."
      ],
      "general": [
        "Compare two cultural events and discuss how they differ.",
        "Describe how technology has changed daily communication in your life.",
        "Explain a local custom and its historical roots in short paragraph form."
      ],
      "opinion": [
        "Discuss whether governments should encourage remote work.",
        "Is higher education worth its cost? Take a position and justify it.",
        "Should cities prioritize green spaces over parking? Explain your view."
      ]
    },

    "medium_complex": {
      "daily_life": [
        "Write a short narrative where an unexpected event changes someone's plans.",
        "Describe the emotional journey of learning a difficult skill.",
        "Explain a small ethical dilemma you encountered and how you resolved it."
      ],
      "general": [
        "Analyze how cultural background influences food preferences.",
        "Discuss the impact of local festivals on community identity.",
        "Explain how a technological change disrupted a familiar routine."
      ],
      "opinion": [
        "Argue for or against mandatory civic service for young adults.",
        "Discuss the pros and cons of algorithm-driven news feeds.",
        "Should urban planning prioritize walkability? Give detailed reasons."
      ]
    },

    "hard_simple": {
      "daily_life": [
        "Describe a complex project you managed and the leadership lessons you learned.",
        "Explain how you would coach someone to improve a specific skill.",
        "Write about a time you had to balance competing responsibilities and what you did."
      ],
      "general": [
        "Explain the long-term effects of a habit you changed years ago.",
        "Describe the role of mentorship in professional development.",
        "Discuss a social trend and its implications for daily life."
      ],
      "opinion": [
        "Take a stance on the balance between privacy and convenience in modern apps.",
        "Is globalization beneficial overall? Provide a nuanced opinion.",
        "Should corporations take active roles in social issues? Defend your view."
      ]
    },

    "hard_intermediate": {
      "daily_life": [
        "Narrate a detailed case where a small decision had broad consequences.",
        "Explain how you'd design a community program to solve a local problem.",
        "Describe how time management strategies vary across cultures."
      ],
      "general": [
        "Analyze the cultural significance of a national holiday and its evolution.",
        "Discuss how economic change affects family structures over time.",
        "Explain the relationship between work culture and well-being in one country."
      ],
      "opinion": [
        "Discuss whether AI regulation should be global or local — provide arguments.",
        "Is cultural appropriation always harmful? Analyze both sides.",
        "Should algorithms used in hiring be audited for fairness? Explain."
      ]
    },

    "hard_complex": {
      "daily_life": [
        "Write an essay exploring how micro-decisions aggregate to shape life outcomes.",
        "Analyze the role of ritual and habit in forming long-term identity.",
        "Describe the systemic factors that made a local problem hard to solve."
      ],
      "general": [
        "Discuss the philosophical implications of memory on personal identity.",
        "Analyze the interplay between economics and cultural production in a region.",
        "Explain how narratives shape public opinion during major events."
      ],
      "opinion": [
        "Take a nuanced position on automation and universal basic income.",
        "Argue how education systems should adapt to a changing job market.",
        "Discuss the ethical trade-offs of gene editing technologies."
      ]
    }
  },

  "es": {
    "easy_simple": {
      "daily_life": [
        "Describe tu rutina de la mañana en dos o tres oraciones simples.",
        "¿Qué sueles desayunar? Descríbelo brevemente.",
        "Escribe tres oraciones sobre cómo llegas al trabajo o a la escuela."
      ],
      "general": [
        "Preséntate en pocas frases (nombre, de dónde eres, trabajo).",
        "Describe tu pasatiempo favorito de forma breve.",
        "Nombra tres cosas que te hacen feliz y explica una de ellas."
      ],
      "opinion": [
        "Di si prefieres café o té y por qué en una oración.",
        "¿Te gusta leer? Da una razón breve por la que sí o no.",
        "¿El ejercicio al aire libre es importante? Explica tu opinión en una oración."
      ]
    },

    "easy_intermediate": {
      "daily_life": [
        "Describe un fin de semana típico usando oraciones conectadas.",
        "Explica un problema pequeño que tuviste recientemente y cómo lo resolviste.",
        "Escribe sobre una comida que cocinaste recientemente y cómo resultó."
      ],
      "general": [
        "Describe a un amigo y explica por qué te gusta pasar tiempo con él/ella.",
        "Escribe sobre tu ciudad en un párrafo corto.",
        "Explica una rutina que quieres cambiar y por qué."
      ],
      "opinion": [
        "¿Crees que las redes sociales son útiles? Da dos razones cortas.",
        "¿Los estudiantes deben tener deberes? Explica brevemente tu opinión.",
        "¿El transporte público es importante en las ciudades? Da tu punto de vista y una razón."
      ]
    },

    "easy_complex": {
      "daily_life": [
        "Cuenta una breve historia sobre un evento pequeño que te sorprendió hoy.",
        "Describe un hábito que adoptaste recientemente y por qué te ayudó.",
        "Explica una actividad cotidiana en pasos como si la enseñaras a un principiante."
      ],
      "general": [
        "Compara dos lugares que te gustan y explica las diferencias.",
        "Describe cómo una estación del año afecta tu estado de ánimo o rutina.",
        "Explica una tradición familiar durante las fiestas."
      ],
      "opinion": [
        "¿La tecnología facilita o dificulta la vida? Da un ejemplo y tu opinión.",
        "¿Deberían las personas aprender varios idiomas? Da razones.",
        "Discute si trabajar desde casa es mejor que ir a la oficina."
      ]
    },

    "medium_simple": {
      "daily_life": [
        "Esboza cómo organizas tu día cuando tienes una agenda ocupada.",
        "Describe una excursión reciente y lo que hiciste paso a paso.",
        "Escribe un plan breve para un fin de semana ideal, con horarios."
      ],
      "general": [
        "Describe una meta que estás persiguiendo y los pasos para lograrla.",
        "Explica cómo se desarrolló un pasatiempo tuyo con el tiempo.",
        "Describe a un modelo a seguir y lo que aprendiste de él/ella."
      ],
      "opinion": [
        "¿Son importantes los centros comunitarios? Defiende tu caso brevemente.",
        "¿Las escuelas deberían enseñar habilidades prácticas? Justifica tu posición.",
        "¿La dieta o el ejercicio es más importante para la salud? Defiende tu elección."
      ]
    },

    "medium_intermediate": {
      "daily_life": [
        "Describe un desafío que enfrentaste y la estrategia que usaste para superarlo.",
        "Explica cómo te preparas para una reunión o examen importante.",
        "Describe los pasos que tomas cuando aprendes algo nuevo."
      ],
      "general": [
        "Compara dos eventos culturales y discute sus diferencias.",
        "Describe cómo la tecnología ha cambiado la comunicación diaria en tu vida.",
        "Explica una costumbre local y sus raíces históricas en un párrafo corto."
      ],
      "opinion": [
        "Discute si los gobiernos deberían fomentar el teletrabajo.",
        "¿Vale la pena la educación superior? Toma posición y justifica.",
        "¿Deberían las ciudades priorizar los espacios verdes sobre el estacionamiento? Explica tu punto de vista."
      ]
    },

    "medium_complex": {
      "daily_life": [
        "Escribe una narrativa corta donde un evento inesperado cambie los planes de alguien.",
        "Describe el viaje emocional de aprender una habilidad difícil.",
        "Explica un dilema ético pequeño que enfrentaste y cómo lo resolviste."
      ],
      "general": [
        "Analiza cómo el trasfondo cultural influye en las preferencias alimentarias.",
        "Discute el impacto de los festivales locales en la identidad comunitaria.",
        "Explica cómo un cambio tecnológico interrumpió una rutina familiar."
      ],
      "opinion": [
        "Argumenta a favor o en contra del servicio cívico obligatorio para jóvenes.",
        "Discute las ventajas y desventajas de los feeds de noticias algorítmicos.",
        "¿Debería la planificación urbana priorizar la capacidad de caminar? Da razones detalladas."
      ]
    },

    "hard_simple": {
      "daily_life": [
        "Describe un proyecto complejo que dirigiste y las lecciones de liderazgo que aprendiste.",
        "Explica cómo entrenarías a alguien para mejorar una habilidad específica.",
        "Escribe sobre una vez que tuviste que equilibrar responsabilidades en conflicto y lo que hiciste."
      ],
      "general": [
        "Explica los efectos a largo plazo de un hábito que cambiaste hace años.",
        "Describe el papel del mentor en el desarrollo profesional.",
        "Discute una tendencia social y sus implicaciones para la vida diaria."
      ],
      "opinion": [
        "Toma posición sobre el equilibrio entre privacidad y conveniencia en las apps modernas.",
        "¿Es beneficiosa la globalización en general? Ofrece una opinión matizada.",
        "¿Deben las empresas involucrarse en temas sociales? Defiende tu punto."
      ]
    },

    "hard_intermediate": {
      "daily_life": [
        "Narra un caso detallado donde una decisión pequeña tuvo amplias consecuencias.",
        "Explica cómo diseñarías un programa comunitario para resolver un problema local.",
        "Describe cómo varían las estrategias de gestión del tiempo entre culturas."
      ],
      "general": [
        "Analiza la importancia cultural de una fiesta nacional y su evolución.",
        "Discute cómo el cambio económico afecta a las estructuras familiares con el tiempo.",
        "Explica la relación entre cultura laboral y bienestar en un país."
      ],
      "opinion": [
        "¿Debería la regulación de IA ser global o local? Presenta argumentos.",
        "¿La apropiación cultural es siempre dañina? Analiza ambos lados.",
        "¿Deben auditarse los algoritmos de contratación para la equidad? Explica."
      ]
    },

    "hard_complex": {
      "daily_life": [
        "Escribe un ensayo sobre cómo las micro-decisiones se agregan para formar resultados vitales.",
        "Analiza el papel del ritual y el hábito en la formación de la identidad a largo plazo.",
        "Describe los factores sistémicos que hicieron que un problema local fuera difícil de resolver."
      ],
      "general": [
        "Discute las implicaciones filosóficas de la memoria en la identidad personal.",
        "Analiza la relación entre economía y producción cultural en una región.",
        "Explica cómo las narrativas moldean la opinión pública durante eventos importantes."
      ],
      "opinion": [
        "Toma una posición matizada sobre la automatización y la renta básica universal.",
        "Argumenta cómo deberían adaptarse los sistemas educativos al mercado laboral cambiante.",
        "Discute los compromisos éticos de las tecnologías de edición genética."
      ]
    }
  },

  "fr": {
    "easy_simple": {
      "daily_life": [
        "Décris ta routine du matin en deux ou trois phrases simples.",
        "Que manges-tu habituellement au petit-déjeuner ? Décris-le brièvement.",
        "Écris trois phrases sur ton trajet pour aller au travail ou à l'école."
      ],
      "general": [
        "Présente-toi en quelques phrases (nom, d'où tu viens, travail).",
        "Décris ton passe-temps préféré brièvement.",
        "Nomme trois choses qui te rendent heureux et explique-en une."
      ],
      "opinion": [
        "Préfères-tu le café ou le thé ? Dis pourquoi en une phrase.",
        "Aimes-tu lire ? Donne une raison courte pour oui ou non.",
        "L'exercice en plein air est-il important ? Exprime ton avis en une phrase."
      ]
    },

    "easy_intermediate": {
      "daily_life": [
        "Décris un week-end typique en utilisant quelques phrases reliées.",
        "Explique un petit problème que tu as eu récemment et comment tu l'as résolu.",
        "Écris au sujet d'un repas que tu as cuisiné récemment et comment c'était."
      ],
      "general": [
        "Décris un ami et explique pourquoi tu aimes passer du temps avec lui/elle.",
        "Écris sur ta ville en un court paragraphe.",
        "Explique une routine que tu veux changer et pourquoi."
      ],
      "opinion": [
        "Les réseaux sociaux sont-ils utiles ? Donne deux raisons courtes.",
        "Les élèves devraient-ils avoir des devoirs ? Explique brièvement ta position.",
        "Le transport public est-il important dans les villes ? Donne ton avis et une raison."
      ]
    },

    "easy_complex": {
      "daily_life": [
        "Raconte une courte histoire sur un petit événement surprenant de ta journée.",
        "Décris une habitude que tu as adoptée récemment et pourquoi elle t'a aidé.",
        "Explique une activité quotidienne en étapes comme si tu l'enseignais à un débutant."
      ],
      "general": [
        "Compare deux endroits que tu aimes et explique les différences.",
        "Décris comment une saison affecte ton humeur ou ta routine.",
        "Explique une tradition familiale pendant les fêtes."
      ],
      "opinion": [
        "La technologie facilite-t-elle la vie ? Donne un exemple et ton avis.",
        "Les gens devraient-ils apprendre plusieurs langues ? Donne des raisons.",
        "Discute si travailler à domicile est meilleur que travailler au bureau."
      ]
    },

    "medium_simple": {
      "daily_life": [
        "Décris comment tu organises ta journée quand tu es très occupé.",
        "Raconte une excursion récente et ce que tu as fait étape par étape.",
        "Écris un bref programme pour un week-end idéal avec des horaires."
      ],
      "general": [
        "Décris un objectif que tu poursuis et les étapes pour l'atteindre.",
        "Explique comment un passe-temps s'est développé chez toi.",
        "Décris un modèle et ce que tu as appris de lui/elle."
      ],
      "opinion": [
        "Les centres communautaires sont-ils importants ? Défends ton point en bref.",
        "Les écoles devraient-elles enseigner des compétences pratiques ? Justifie ta position.",
        "Le régime ou l'exercice est-il plus important pour la santé ? Défends ton choix."
      ]
    },

    "medium_intermediate": {
      "daily_life": [
        "Décris un défi que tu as relevé et la stratégie que tu as utilisée.",
        "Explique comment tu te prépares pour un examen ou une réunion importante.",
        "Décris les étapes que tu prends pour apprendre quelque chose de nouveau."
      ],
      "general": [
        "Compare deux événements culturels et discute des différences.",
        "Décris comment la technologie a changé la communication quotidienne dans ta vie.",
        "Explique une coutume locale et ses racines historiques en un court paragraphe."
      ],
      "opinion": [
        "Discute si les gouvernements devraient encourager le télétravail.",
        "L'enseignement supérieur vaut-il son coût ? Prends position et justifie.",
        "Les villes devraient-elles prioriser les espaces verts plutôt que le stationnement ? Explique."
      ]
    },

    "medium_complex": {
      "daily_life": [
        "Écris une courte histoire où un événement inattendu change les plans de quelqu'un.",
        "Décris le parcours émotionnel d'apprendre une compétence difficile.",
        "Explique un petit dilemme éthique que tu as rencontré et comment tu l'as résolu."
      ],
      "general": [
        "Analyse comment l'origine culturelle influence les préférences alimentaires.",
        "Discute de l'impact des festivals locaux sur l'identité de la communauté.",
        "Explique comment un changement technologique a perturbé une routine familière."
      ],
      "opinion": [
        "Argumente pour ou contre le service civique obligatoire pour les jeunes.",
        "Discute des avantages et inconvénients des fils d'actualité algorithmiques.",
        "La planification urbaine devrait-elle privilégier la marche ? Donne des raisons."
      ]
    },

    "hard_simple": {
      "daily_life": [
        "Décris un projet complexe que tu as dirigé et les leçons de leadership que tu en as tirées.",
        "Explique comment tu entraînerais quelqu'un pour améliorer une compétence spécifique.",
        "Écris sur un moment où tu as dû équilibrer des responsabilités contradictoires et ce que tu as fait."
      ],
      "general": [
        "Explique les effets à long terme d'une habitude que tu as changée il y a des années.",
        "Décris le rôle du mentorat dans le développement professionnel.",
        "Discute d'une tendance sociale et de ses implications pour la vie quotidienne."
      ],
      "opinion": [
        "Positionne-toi sur l'équilibre entre vie privée et commodité dans les applications modernes.",
        "La mondialisation est-elle bénéfique ? Offre une opinion nuancée.",
        "Les entreprises devraient-elles s'impliquer dans des sujets sociaux ? Défends ton point."
      ]
    },

    "hard_intermediate": {
      "daily_life": [
        "Raconte un cas détaillé où une petite décision a eu de larges conséquences.",
        "Explique comment concevoirais un programme communautaire pour résoudre un problème local.",
        "Décris comment les stratégies de gestion du temps varient selon les cultures."
      ],
      "general": [
        "Analyse la signification culturelle d'une fête nationale et son évolution.",
        "Discute comment le changement économique affecte les structures familiales dans le temps.",
        "Explique la relation entre culture du travail et bien-être dans un pays."
      ],
      "opinion": [
        "La régulation de l'IA devrait-elle être globale ou locale ? Présente des arguments.",
        "L'appropriation culturelle est-elle toujours nuisible ? Analyse les deux côtés.",
        "Les algorithmes de recrutement devraient-ils être audités pour l'équité ? Explique."
      ]
    },

    "hard_complex": {
      "daily_life": [
        "Écris un essai sur comment les microdécisions s'agrègent pour former les résultats de la vie.",
        "Analyse le rôle du rituel et de l'habitude dans la formation de l'identité à long terme.",
        "Décris les facteurs systémiques qui ont rendu difficile la résolution d'un problème local."
      ],
      "general": [
        "Discute des implications philosophiques de la mémoire sur l'identité personnelle.",
        "Analyse l'interaction entre économie et production culturelle dans une région.",
        "Explique comment les récits façonnent l'opinion publique lors d'événements majeurs."
      ],
      "opinion": [
        "Prends position sur l'automatisation et le revenu universel.",
        "Argumente comment les systèmes éducatifs devraient s'adapter au marché du travail changeant.",
        "Discute des compromis éthiques des technologies d'édition génétique."
      ]
    }
  },

  "kr": {
    "easy_simple": {
      "daily_life": [
        "간단하게 아침 일과를 두세 문장으로 묘사하세요.",
        "아침에 보통 무엇을 먹나요? 간단히 설명하세요.",
        "통학이나 출근에 대해 세 문장 정도로 써보세요."
      ],
      "general": [
        "자기소개를 간단히 해보세요 (이름, 출신, 직업).",
        "가장 좋아하는 취미를 짧게 설명하세요.",
        "당신을 행복하게 하는 세 가지를 말하고 하나를 설명하세요."
      ],
      "opinion": [
        "커피와 차 중 무엇을 선호하나요? 한 문장으로 이유를 쓰세요.",
        "독서를 좋아하나요? 간단한 이유를 쓰세요.",
        "야외 운동이 중요하다고 생각하나요? 한 문장으로 의견을 표현하세요."
      ]
    },

    "easy_intermediate": {
      "daily_life": [
        "평범한 주말을 연결된 문장으로 묘사하세요.",
        "최근에 겪은 작은 문제와 해결 방법을 설명하세요.",
        "최근에 요리한 음식을 어떻게 만들었는지 적어보세요."
      ],
      "general": [
        "친구를 묘사하고 왜 함께 시간을 보내는 것을 좋아하는지 설명하세요.",
        "당신이 사는 도시를 짧은 단락으로 소개하세요.",
        "바꾸고 싶은 일상 습관과 그 이유를 설명하세요."
      ],
      "opinion": [
        "소셜 미디어가 도움이 된다고 생각하나요? 두 가지 이유를 쓰세요.",
        "학생들이 숙제를 해야 한다고 생각하나요? 간단히 의견을 말하세요.",
        "대중교통은 도시에서 중요한가요? 당신의 관점을 말하고 이유를 쓰세요."
      ]
    },

    "easy_complex": {
      "daily_life": [
        "하루 중 놀랐던 작은 사건에 관한 짧은 이야기를 쓰세요.",
        "최근에 만든 습관과 그것이 어떻게 도움이 되었는지 설명하세요.",
        "초보자에게 가르치듯 일상 활동을 단계별로 설명하세요."
      ],
      "general": [
        "좋아하는 두 장소를 비교하고 차이점을 설명하세요.",
        "계절이 기분이나 일상에 어떤 영향을 미치는지 쓰세요.",
        "가족 전통이나 명절을 설명하세요."
      ],
      "opinion": [
        "기술은 삶을 더 쉽게 만들까요? 예와 함께 의견을 쓰세요.",
        "여러 언어를 배우는 것이 필요하다고 생각하나요? 이유를 쓰세요.",
        "재택근무가 사무실 근무보다 낫다고 생각하나요? 이유를 설명하세요."
      ]
    },

    "medium_simple": {
      "daily_life": [
        "바쁜 일정에서 하루를 어떻게 조직하는지 설명하세요.",
        "최근 당일치기 여행을 단계별로 이야기하세요.",
        "이상적인 주말 계획을 간단한 시간표와 함께 쓰세요."
      ],
      "general": [
        "달성하려는 목표와 이를 위한 단계들을 설명하세요.",
        "취미가 어떻게 발전했는지 서술하세요.",
        "롤 모델을 묘사하고 배운 점을 적으세요."
      ],
      "opinion": [
        "지역 커뮤니티 센터가 중요하다고 생각하나요? 간단히 주장하세요.",
        "학교에서 실용 기술을 가르쳐야 한다고 생각하나요? 이유를 쓰세요.",
        "건강에는 식단과 운동 중 무엇이 더 중요하다고 생각하나요? 선택하고 이유를 설명하세요."
      ]
    },

    "medium_intermediate": {
      "daily_life": [
        "극복했던 도전과 사용한 전략을 묘사하세요.",
        "중요한 회의나 시험에 어떻게 준비하는지 설명하세요.",
        "새로운 것을 배울 때 취하는 단계들을 적으세요."
      ],
      "general": [
        "두 문화 행사를 비교하고 차이점을 논하세요.",
        "기술이 일상 커뮤니케이션을 어떻게 바꿨는지 설명하세요.",
        "지역 관습과 그 역사적 근원을 짧게 설명하세요."
      ],
      "opinion": [
        "정부가 재택근무를 장려해야 한다고 생각하나요? 토론하세요.",
        "고등 교육이 비용 대비 가치가 있나요? 입장을 밝히고 근거를 제시하세요.",
        "도시가 녹지 공간을 주차장보다 우선해야 할까요? 관점을 말하세요."
      ]
    },

    "medium_complex": {
      "daily_life": [
        "예기치 않은 사건이 누군가의 계획을 어떻게 바꾸었는지 서술하는 단편을 쓰세요.",
        "어려운 기술을 배우는 동안의 감정적 여정을 묘사하세요.",
        "작은 윤리적 딜레마를 설명하고 해결 방법을 제시하세요."
      ],
      "general": [
        "문화적 배경이 음식 선호에 어떤 영향을 미치는지 분석하세요.",
        "지역 축제가 공동체 정체성에 미치는 영향을 논하세요.",
        "기술 변화가 일상적 루틴을 어떻게 방해했는지 설명하세요."
      ],
      "opinion": [
        "청년 의무 복무에 찬성하거나 반대하는 주장을 제시하세요.",
        "알고리즘 기반 뉴스 피드의 장단점을 논하세요.",
        "도시 계획이 보행성을 우선해야 한다고 생각하나요? 이유를 제시하세요."
      ]
    },

    "hard_simple": {
      "daily_life": [
        "복잡한 프로젝트를 관리했던 경험과 배운 리더십 교훈을 설명하세요.",
        "특정 기술을 향상시키기 위해 누군가를 어떻게 코치할지 설명하세요.",
        "상충하는 책임을 균형있게 처리해야 했던 경험을 이야기하세요."
      ],
      "general": [
        "오랜 기간 전에 바꾼 습관의 장기적 효과를 설명하세요.",
        "멘토십이 직업적 발전에 하는 역할을 설명하세요.",
        "사회적 트렌드와 일상생활에 미치는 영향에 대해 논하세요."
      ],
      "opinion": [
        "현대 앱의 프라이버시와 편의성 사이의 균형에 대한 입장을 제시하세요.",
        "세계화는 전반적으로 이익을 가져다주나요? 균형 잡힌 의견을 쓰세요.",
        "기업이 사회 문제에 개입해야 할까요? 당신의 의견을 지지하세요."
      ]
    },

    "hard_intermediate": {
      "daily_life": [
        "작은 결정이 광범위한 결과를 초래한 사례를 자세히 서술하세요.",
        "지역 문제를 해결하기 위한 커뮤니티 프로그램을 어떻게 설계할지 설명하세요.",
        "문화별 시간 관리 전략이 어떻게 다른지 설명하세요."
      ],
      "general": [
        "국경일의 문화적 중요성과 진화를 분석하세요.",
        "경제 변화가 가족 구조에 미치는 장기적 영향을 논하세요.",
        "근무 문화와 복지의 관계를 특정 국가 사례로 설명하세요."
      ],
      "opinion": [
        "AI 규제가 글로벌해야 할까 지역적이어야 할까? 논거를 제시하세요.",
        "문화적 전유가 항상 해로운가? 양측을 분석하세요.",
        "채용 알고리즘의 공정성 검토가 필요하다고 생각하나요? 설명하세요."
      ]
    },

    "hard_complex": {
      "daily_life": [
        "미시적 결정들이 삶의 결과를 어떻게 형성하는지에 대한 에세이를 쓰세요.",
        "의식과 습관이 장기적 정체성 형성에 미치는 역할을 분석하세요.",
        "지역 문제가 해결되기 어려웠던 시스템적 요인을 기술하세요."
      ],
      "general": [
        "기억과 개인 정체성의 철학적 의미를 논하세요.",
        "지역의 경제와 문화 생산 사이의 상호작용을 분석하세요.",
        "중요 사건 동안 서사가 여론을 형성하는 방식을 설명하세요."
      ],
      "opinion": [
        "자동화와 기본소득에 대한 중립적 입장을 제시하세요.",
        "교육 시스템이 변화하는 직업 시장에 맞춰 어떻게 적응해야 하는지 논하세요.",
        "유전자 편집 기술의 윤리적 트레이드오프를 토론하세요."
      ]
    }
  },

  "no": {
    "easy_simple": {
      "daily_life": [
        "Beskriv morgenrutinen din i to eller tre enkle setninger.",
        "Hva spiser du vanligvis til frokost? Beskriv kort.",
        "Skriv tre setninger om hvordan du kommer deg til jobb eller skole."
      ],
      "general": [
        "Presenter deg selv i noen enkle setninger (navn, hvor du kommer fra, jobb).",
        "Beskriv din favoritt hobby kort.",
        "Nevn tre ting som gjør deg glad og forklar en av dem."
      ],
      "opinion": [
        "Foretrekker du kaffe eller te? Skriv en setning med grunn.",
        "Liker du å lese? Gi en kort grunn for ja eller nei.",
        "Er utendørs trening viktig? Skriv din mening i en setning."
      ]
    },

    "easy_intermediate": {
      "daily_life": [
        "Beskriv en typisk helg med noen sammenhengende setninger.",
        "Forklar et lite problem du hadde nylig og hvordan du løste det.",
        "Skriv om et måltid du lagde nylig og hvordan det ble."
      ],
      "general": [
        "Beskriv en venn og forklar hvorfor du liker å være sammen med ham/henne.",
        "Skriv kort om byen din.",
        "Forklar en rutine du ønsker å endre og hvorfor."
      ],
      "opinion": [
        "Er sosiale medier nyttig? Gi to korte grunner.",
        "Bør elever ha lekser? Forklar din mening kort.",
        "Er kollektivtransport viktig i byer? Si din mening og en grunn."
      ]
    },

    "easy_complex": {
      "daily_life": [
        "Fortell en kort historie om en liten hendelse som overrasket deg i dag.",
        "Beskriv en vane du nylig begynte med og hvordan det hjalp deg.",
        "Forklar en daglig aktivitet i trinn som om du lærte en nybegynner."
      ],
      "general": [
        "Sammenlign to steder du liker og forklar forskjellene.",
        "Beskriv hvordan en årstid påvirker humøret eller rutinen din.",
        "Forklar en familie tradisjon i høytiden."
      ],
      "opinion": [
        "Gjør teknologi livet enklere? Gi et eksempel og din mening.",
        "Burde folk lære flere språk? Gi grunner.",
        "Er hjemmekontor bedre enn kontorarbeid? Forklar hvorfor."
      ]
    },

    "medium_simple": {
      "daily_life": [
        "Skriv hvordan du organiserer dagen når du har en travel timeplan.",
        "Beskriv en dagstur og hva du gjorde trinnvis.",
        "Lag en kort plan for en ideell helg med tidspunkter."
      ],
      "general": [
        "Beskriv et mål du jobber mot og trinnene for å oppnå det.",
        "Forklar hvordan en hobby utviklet seg over tid.",
        "Beskriv en rollemodell og hva du lærte av ham/henne."
      ],
      "opinion": [
        "Er lokalsentre viktige? Forsvar saken din kort.",
        "Bør skoler lære praktiske ferdigheter? Begrunn svaret.",
        "Hva er viktigst for helse, kosthold eller trening? Velg og forklar."
      ]
    },

    "medium_intermediate": {
      "daily_life": [
        "Beskriv en utfordring du møtte og strategien du brukte for å løse den.",
        "Forklar hvordan du forbereder deg til en viktig eksamen eller møte.",
        "Beskriv trinnene du tar for å lære noe nytt."
      ],
      "general": [
        "Sammenlign to kulturelle hendelser og diskuter forskjellene.",
        "Forklar hvordan teknologi har endret daglig kommunikasjon i livet ditt.",
        "Forklar en lokal skikk og dens historiske røtter i en kort avsnitt."
      ],
      "opinion": [
        "Bør regjeringer oppmuntre fjernarbeid? Diskuter.",
        "Er høyere utdanning verdt kostnaden? Ta stilling og begrunn.",
        "Bør byer prioritere grøntområder fremfor parkeringsplasser? Forklar."
      ]
    },

    "medium_complex": {
      "daily_life": [
        "Skriv et kort narrative hvor en uventet hendelse endrer noens planer.",
        "Beskriv den emosjonelle reisen ved å lære en vanskelig ferdighet.",
        "Forklar en liten etisk dilemma du møtte og hvordan du løste det."
      ],
      "general": [
        "Analyser hvordan kulturell bakgrunn påvirker matpreferanser.",
        "Diskuter påvirkningen av lokale festivaler på fellesskapsidentitet.",
        "Forklar hvordan en teknologisk endring forstyrret en kjent rutine."
      ],
      "opinion": [
        "Argumenter for eller mot obligatorisk samfunnstjeneste for unge voksne.",
        "Diskuter fordelene og ulempene med algoritmedrevet nyhetsstrøm.",
        "Bør byplanlegging prioritere gange? Gi detaljerte grunner."
      ]
    },

    "hard_simple": {
      "daily_life": [
        "Beskriv et komplekst prosjekt du ledet og lederlærdommen du fikk.",
        "Forklar hvordan du vil coache noen for å forbedre en spesifikk ferdighet.",
        "Skriv om en tid du måtte balansere konkurrerende ansvar og hva du gjorde."
      ],
      "general": [
        "Forklar de langsiktige effektene av en vane du endret for år siden.",
        "Beskriv rollen til mentor i profesjonell utvikling.",
        "Diskuter en sosial trend og dens implikasjoner for dagliglivet."
      ],
      "opinion": [
        "Ta stilling til balansen mellom personvern og bekvemmelighet i moderne apper.",
        "Er globalisering gunstig? Gi en nyansert mening.",
        "Bør selskaper ta aktive roller i sosiale spørsmål? Forsvar ditt syn."
      ]
    },

    "hard_intermediate": {
      "daily_life": [
        "Nå en detaljert sak der en liten beslutning hadde store konsekvenser.",
        "Forklar hvordan du vil designe et lokalt program for å løse et problem.",
        "Beskriv hvordan tidshåndteringsstrategier varierer mellom kulturer."
      ],
      "general": [
        "Analyser den kulturelle betydningen av en nasjonal høytid og dens utvikling.",
        "Diskuter hvordan økonomisk endring påvirker familier over tid.",
        "Forklar forholdet mellom arbeidspartner og velferd i et land."
      ],
      "opinion": [
        "Bør AI-regulering være global eller lokal? Presenter argumenter.",
        "Er kulturell appropriasjon alltid skadelig? Analyser begge sider.",
        "Bør rekrutteringsalgoritmer revideres for rettferdighet? Forklar."
      ]
    },

    "hard_complex": {
      "daily_life": [
        "Skriv et essay om hvordan mikrobeslutninger akkumuleres til å forme livsutfall.",
        "Analyser rollen til ritual og vane i å forme langsiktig identitet.",
        "Beskriv systemfaktorene som gjorde en lokal sak vanskelig å løse."
      ],
      "general": [
        "Diskuter de filosofiske implikasjonene av hukommelse for personlig identitet.",
        "Analyser samspillet mellom økonomi og kulturell produksjon i en region.",
        "Forklar hvordan narrativer former offentlig mening under store hendelser."
      ],
      "opinion": [
        "Argumenter om hvordan utdanningssystemer bør tilpasse seg det skiftende arbeidsmarkedet.",
        "Ta en nyansert posisjon om automatisering og grunninntekt.",
        "Diskuter etisk avveining ved genredigeringsteknologi."
      ]
    }
  },

  "de": {
    "easy_simple": {
      "daily_life": [
        "Beschreibe deine Morgenroutine in zwei oder drei einfachen Sätzen.",
        "Was isst du normalerweise zum Frühstück? Beschreibe es kurz.",
        "Schreibe drei Sätze darüber, wie du zur Arbeit oder Schule kommst."
      ],
      "general": [
        "Stelle dich in ein paar einfachen Sätzen vor (Name, Herkunft, Beruf).",
        "Beschreibe dein Lieblingshobby kurz.",
        "Nenne drei Dinge, die dich glücklich machen, und erkläre eine davon."
      ],
      "opinion": [
        "Bevorzugst du Kaffee oder Tee? Nenne einen Grund in einem Satz.",
        "Liest du gerne? Gib einen kurzen Grund dafür.",
        "Ist Sport im Freien wichtig? Schreibe deine Meinung in einem Satz."
      ]
    },

    "easy_intermediate": {
      "daily_life": [
        "Beschreibe ein typisches Wochenende mit ein paar verbundenen Sätzen.",
        "Erkläre ein kleines Problem, das du neulich hattest, und wie du es gelöst hast.",
        "Schreibe über ein Gericht, das du kürzlich gekocht hast, und wie es geworden ist."
      ],
      "general": [
        "Beschreibe einen Freund und erkläre, warum du gerne Zeit mit ihm verbringst.",
        "Schreibe kurz über deine Stadt.",
        "Erkläre eine Routine, die du ändern möchtest, und warum."
      ],
      "opinion": [
        "Sind soziale Medien nützlich? Nenne zwei kurze Gründe.",
        "Sollten Schüler Hausaufgaben haben? Erkläre kurz deine Meinung.",
        "Ist öffentlicher Verkehr in Städten wichtig? Teile deine Sicht und einen Grund."
      ]
    },

    "easy_complex": {
      "daily_life": [
        "Erzähle eine kurze Geschichte über ein kleines, überraschendes Ereignis heute.",
        "Beschreibe eine Gewohnheit, die du kürzlich angenommen hast, und warum sie geholfen hat.",
        "Erkläre eine tägliche Aktivität Schritt für Schritt, als würdest du einem Anfänger beibringen."
      ],
      "general": [
        "Vergleiche zwei Orte, die du magst, und erkläre die Unterschiede.",
        "Beschreibe, wie eine Jahreszeit deine Stimmung oder Routine beeinflusst.",
        "Erkläre eine Familientradition während der Feiertage."
      ],
      "opinion": [
        "Macht Technologie das Leben einfacher? Gib ein Beispiel und deine Meinung.",
        "Sollten Menschen mehrere Sprachen lernen? Gib Gründe.",
        "Ist Homeoffice besser als Büroarbeit? Erkläre warum."
      ]
    },

    "medium_simple": {
      "daily_life": [
        "Schreibe, wie du deinen Tag organisierst, wenn du einen vollen Zeitplan hast.",
        "Beschreibe einen Tagesausflug und was du Schritt für Schritt getan hast.",
        "Erstelle einen kurzen Plan für ein ideales Wochenende mit Uhrzeiten."
      ],
      "general": [
        "Beschreibe ein Ziel, an dem du arbeitest, und die Schritte, um es zu erreichen.",
        "Erkläre, wie sich ein Hobby bei dir entwickelt hat.",
        "Beschreibe eine Vorbildperson und was du von ihr gelernt hast."
      ],
      "opinion": [
        "Sind Gemeindezentren wichtig? Begründe kurz.",
        "Sollten Schulen praktische Fähigkeiten lehren? Begründe deine Position.",
        "Was ist wichtiger für die Gesundheit: Ernährung oder Bewegung? Wähle und erkläre."
      ]
    },

    "medium_intermediate": {
      "daily_life": [
        "Beschreibe eine Herausforderung, der du dich gestellt hast, und die Strategie, die du angewendet hast.",
        "Erkläre, wie du dich auf eine wichtige Besprechung oder Prüfung vorbereitest.",
        "Beschreibe die Schritte, die du unternimmst, um etwas Neues zu lernen."
      ],
      "general": [
        "Vergleiche zwei kulturelle Veranstaltungen und diskutiere die Unterschiede.",
        "Beschreibe, wie Technologie die tägliche Kommunikation in deinem Leben verändert hat.",
        "Erkläre eine lokale Gewohnheit und ihre historischen Wurzeln in einem kurzen Absatz."
      ],
      "opinion": [
        "Sollten Regierungen Telearbeit fördern? Diskutiere.",
        "Ist Hochschulbildung die Kosten wert? Nimm Stellung und begründe.",
        "Sollten Städte Grünflächen Vorrang vor Parkplätzen geben? Erkläre."
      ]
    },

    "medium_complex": {
      "daily_life": [
        "Schreibe eine kurze Erzählung, in der ein unerwartetes Ereignis die Pläne einer Person ändert.",
        "Beschreibe die emotionale Reise beim Erlernen einer schwierigen Fertigkeit.",
        "Erkläre ein kleines ethisches Dilemma, dem du begegnet bist, und wie du es gelöst hast."
      ],
      "general": [
        "Analysiere, wie kultureller Hintergrund Essenspräferenzen beeinflusst.",
        "Diskutiere die Auswirkungen lokaler Festivals auf die Gemeinschaftsidentität.",
        "Erkläre, wie eine technologische Veränderung eine vertraute Routine gestört hat."
      ],
      "opinion": [
        "Argumentiere für oder gegen Pflicht-Bürgerservice für junge Erwachsene.",
        "Diskutiere die Vor- und Nachteile algorithmischer Newsfeeds.",
        "Sollte Stadtplanung Fußgängerfreundlichkeit priorisieren? Gib detaillierte Gründe."
      ]
    },

    "hard_simple": {
      "daily_life": [
        "Beschreibe ein komplexes Projekt, das du geleitet hast, und die Führungslektionen, die du gelernt hast.",
        "Erkläre, wie du jemanden coachen würdest, um eine bestimmte Fähigkeit zu verbessern.",
        "Schreibe über eine Zeit, in der du konkurrierende Verantwortlichkeiten ausgleichen musstest und was du getan hast."
      ],
      "general": [
        "Erkläre die langfristigen Effekte einer Gewohnheit, die du vor Jahren geändert hast.",
        "Beschreibe die Rolle von Mentoring in beruflicher Entwicklung.",
        "Diskutiere einen sozialen Trend und seine Auswirkungen auf den Alltag."
      ],
      "opinion": [
        "Beziehe Stellung zum Gleichgewicht zwischen Privatsphäre und Komfort in modernen Apps.",
        "Ist Globalisierung insgesamt vorteilhaft? Gib eine nuancierte Meinung.",
        "Sollten Unternehmen aktive Rollen in sozialen Fragen übernehmen? Verteidige deine Sicht."
      ]
    },

    "hard_intermediate": {
      "daily_life": [
        "Erläutere einen detaillierten Fall, in dem eine kleine Entscheidung weitreichende Konsequenzen hatte.",
        "Erkläre, wie du ein Gemeindeprogramm zur Lösung eines lokalen Problems entwerfen würdest.",
        "Beschreibe, wie Zeitmanagementstrategien zwischen Kulturen variieren."
      ],
      "general": [
        "Analysiere die kulturelle Bedeutung eines Nationalfeiertags und seine Entwicklung.",
        "Diskutiere, wie wirtschaftlicher Wandel Familienstrukturen im Laufe der Zeit beeinflusst.",
        "Erkläre die Beziehung zwischen Arbeitskultur und Wohlbefinden in einem bestimmten Land."
      ],
      "opinion": [
        "Sollte KI-Gesetzgebung global oder lokal sein? Stelle Argumente vor.",
        "Ist kulturelle Aneignung immer schädlich? Analysiere beide Seiten.",
        "Sollten Einstellungsalgorithmen auf Fairness geprüft werden? Erkläre."
      ]
    },

    "hard_complex": {
      "daily_life": [
        "Schreibe einen Essay darüber, wie Mikroentscheidungen Lebensresultate formen.",
        "Analysiere die Rolle von Ritual und Gewohnheit bei der Bildung langfristiger Identität.",
        "Beschreibe die systemischen Faktoren, die ein lokales Problem schwer lösbar machten."
      ],
      "general": [
        "Diskutiere die philosophischen Implikationen von Erinnerung für persönliche Identität.",
        "Analysiere das Zusammenspiel von Wirtschaft und kultureller Produktion in einer Region.",
        "Erkläre, wie Narrative die öffentliche Meinung in großen Ereignissen formen."
      ],
      "opinion": [
        "Argumentiere, wie Bildungssysteme sich an einen sich verändernden Arbeitsmarkt anpassen sollten.",
        "Nimm eine nuancierte Position zu Automatisierung und bedingungslosem Grundeinkommen ein.",
        "Diskutiere die ethischen Kompromisse von Gentechnik."
      ]
    }
  },

  "zh": {
    "easy_simple": {
      "daily_life": [
        "用两到三句简单的话描述你的早晨日常。",
        "你通常早餐吃什么？简要描述。",
        "写三句关于你如何去上班或上学的话。"
      ],
      "general": [
        "用简短的几句话介绍你自己（名字、来自哪里、职业）。",
        "简短描述你最喜欢的爱好。",
        "列出三件让你快乐的事，并解释其中一件。"
      ],
      "opinion": [
        "你更喜欢咖啡还是茶？用一句话说明理由。",
        "你喜欢阅读吗？给出一个简短理由。",
        "户外运动重要吗？用一句话表达你的看法。"
      ]
    },

    "easy_intermediate": {
      "daily_life": [
        "用连贯的句子描述一个典型的周末。",
        "解释你最近遇到的一个小问题以及你如何解决它。",
        "写一篇关于你最近做的一道菜以及结果的短文。"
      ],
      "general": [
        "描述一个朋友并解释你为什么喜欢和他/她在一起。",
        "用一小段话介绍你的城市。",
        "解释一个你想改变的习惯以及原因。"
      ],
      "opinion": [
        "你认为社交媒体有帮助吗？给出两个简短理由。",
        "学生应该有家庭作业吗？简短说明你的观点。",
        "城市里公共交通重要吗？说明你的看法和一个原因。"
      ]
    },

    "easy_complex": {
      "daily_life": [
        "讲一个今天发生的小事件并说明为什么让你惊讶的短故事。",
        "描述你最近养成的一个习惯以及它如何帮助了你。",
        "像教初学者一样分步骤解释一个日常活动。"
      ],
      "general": [
        "比较两个你喜欢的地方并解释差异。",
        "描述一个季节如何影响你的情绪或日常。",
        "解释你家庭在节日期间的传统。"
      ],
      "opinion": [
        "技术是让生活更容易还是更难？举例说明并表达你的观点。",
        "人们是否应该学习多种语言？说明理由。",
        "讨论在家工作是否优于在办公室工作。"
      ]
    },

    "medium_simple": {
      "daily_life": [
        "概述当你日程繁忙时你如何安排一天。",
        "描述一次最近的短途旅行并逐步说明你做了什么。",
        "写一个理想周末的简短计划并标注时间。"
      ],
      "general": [
        "描述你正在努力实现的一个目标以及实现它的步骤。",
        "解释你的爱好是如何随着时间发展的。",
        "描述一个榜样以及你从他/她身上学到了什么。"
      ],
      "opinion": [
        "社区中心重要吗？简要说明理由。",
        "学校是否应教授实用生活技能？说明理由。",
        "在健康方面，饮食还是运动更重要？选择并解释。"
      ]
    },

    "medium_intermediate": {
      "daily_life": [
        "描述你面对的一个挑战以及你克服它的策略。",
        "解释你如何为重要考试或会议准备。",
        "说明学习新事物时你采取的步骤。"
      ],
      "general": [
        "比较两个文化活动并讨论它们的不同之处。",
        "描述技术如何改变了你日常的沟通方式。",
        "简要解释一种地方习俗及其历史渊源。"
      ],
      "opinion": [
        "政府应鼓励远程工作吗？讨论理由。",
        "高等教育是否物有所值？表明立场并说明理由。",
        "城市应优先考虑绿地还是停车位？说明观点。"
      ]
    },

    "medium_complex": {
      "daily_life": [
        "写一个短篇叙述，描述一次意外事件如何改变某人的计划。",
        "描述学习一项困难技能时的情感旅程。",
        "解释你曾遇到的一个小伦理困境以及如何解决它。"
      ],
      "general": [
        "分析文化背景如何影响食物偏好。",
        "讨论地方节日对社区认同的影响。",
        "解释技术变革如何打破了熟悉的惯例。"
      ],
      "opinion": [
        "论述是否应为年轻人设立强制性的社会服务。",
        "讨论算法驱动新闻信息流的利弊。",
        "城市规划应该优先考虑步行性吗？给出详细理由。"
      ]
    },

    "hard_simple": {
      "daily_life": [
        "描述一个你管理的复杂项目以及你学到的领导经验。",
        "解释你将如何指导某人提高特定技能。",
        "写一次你需要平衡冲突责任的经历以及你如何处理。"
      ],
      "general": [
        "解释改变多年习惯的长期效果。",
        "描述导师在职业发展的作用。",
        "讨论一个社会趋势及其对日常生活的影响。"
      ],
      "opinion": [
        "在现代应用中，隐私与便利之间应如何平衡？阐述你的观点。",
        "全球化总体上是有益的吗？提供一个平衡的观点。",
        "公司是否应该在社会问题上采取积极角色？为你的观点辩护。"
      ]
    },

    "hard_intermediate": {
      "daily_life": [
        "讲述一个小决定产生广泛影响的详细案例。",
        "解释如何设计社区项目以解决本地问题。",
        "描述不同时文化间时间管理策略的差异。"
      ],
      "general": [
        "分析国庆或重要节日在文化上的意义及其演变。",
        "讨论经济变化如何影响家庭结构的长期趋势。",
        "解释工作文化与福祉在某国之间的关系。"
      ],
      "opinion": [
        "人工智能的监管应是全球性的还是地方性的？提出论点。",
        "文化挪用是否总是有害？分析双方观点。",
        "招聘算法应否进行公平性审计？说明理由。"
      ]
    },

    "hard_complex": {
      "daily_life": [
        "写一篇探讨微观决策如何累计成影响人生结果的论文。",
        "分析仪式与习惯在长期身份形成中的角色。",
        "描述一项本地问题难以解决的系统性因素。"
      ],
      "general": [
        "讨论记忆对个人身份的哲学影响。",
        "分析经济与文化生产在地区内的相互作用。",
        "解释叙事如何在重大事件中塑造公众舆论。"
      ],
      "opinion": [
        "论述教育系统如何适应不断变化的就业市场。",
        "就自动化与基础收入提出一个细致的立场。",
        "讨论基因编辑技术的伦理权衡。"
      ]
    }
  }
}
